[
    {
        "name": "Law Office of Kenneth Wake",
        "longDesc": "Deployed for a local law office utilizing HTML, CSS & Bootstrap to achieve a static landing page while using web APIs for Google Maps and contact form integration, with some use of JS animation libraries",
        "imgSrc": "/images/KW_Display.png",
        "isPublic": false,
        "codeUrl": "",
        "previewUrl": "https://kennethwake.com"
    },
    {
        "name": "TM Buddy",
        "longDesc": "TM Buddy is a manager tool built for a high volume enterprise environment. It's powered by React, React Router, React-Bootstrap and styled with custom SCSS.",
        "imgSrc": "/images/TMBuddyDisplay.png",
        "isPublic": true,
        "codeUrl": "https://github.com/drewdoesdevelopment/TM-Buddy",
        "previewUrl": "https://www.tmbuddy.net/"
    },
    {
        "name": "Drew Develops (current)",
        "longDesc": "Built with SvelteKit using fully unique styles designed myself, this refreshed website is not only a visual improvement from my last, but also a performance improvement. I've made a dark/light-mode theme selector that will set default to your OS theme, or allow you to change it yourself. Additionally, templating is used in favor of hardcoded html where possible. SvelteKit was chosen intentionally for performance and to maintain as lightweight of a footprint on the client as my first portfolio.",
        "imgSrc": "/images/DrewDevelopsDisplayNew.png",
        "isPublic": false,
        "previewUrl": "https://www.drewdevelops.com/"
    },
    {
        "name": "Drew Develops (previous)",
        "longDesc": "My previous portfolio developed in 2020, which I designed myself using Figma and created with vanilla CSS and JS, no use of frameworks or prebuilt components.",
        "imgSrc": "/images/DrewDevelopsDisplay.png",
        "isPublic": true,
        "codeUrl": "https://github.com/drewdoesdevelopment/Drew-Develops-Portfolio",
        "previewUrl": "https://www.drewdevelops.com/"
    }
]
